reports/2025-10-14T20-57-47-592Z.txt
     âœ— status is 200
      â†³  97% â€” âœ“ 153 / âœ— 4
     âœ— status is 4xx or 5xx (error)
      â†³  2% â€” âœ“ 4 / âœ— 153
     âœ— response time < 800ms
      â†³  78% â€” âœ“ 124 / âœ— 33
     âœ— response time < 2s (acceptable)
      â†³  92% â€” âœ“ 145 / âœ— 12
     âœ“ response body is not empty
     âœ“ response content-type is JSON
     âœ“ contains expected keys

     checks.........................: 81.61% âœ“ 897    âœ— 202
     data_received..................: 5.9 MB 225 kB/s
     data_sent......................: 180 kB 6.8 kB/s
     http_req_blocked...............: avg=71.1ms   min=4.46Âµs  med=13.98Âµs max=1.12s     p(90)=37.76Âµs  p(95)=1.11s    
     http_req_connecting............: avg=15.87ms  min=0s       med=0s       max=251.79ms  p(90)=0s        p(95)=247.15ms 
     http_req_duration..............: avg=623.1ms  min=256.49ms med=294.79ms max=3.19s     p(90)=1.77s     p(95)=2.28s    
       { expected_response:true }...: avg=624.97ms min=256.49ms med=293.16ms max=3.19s     p(90)=1.79s     p(95)=2.29s    
     http_req_failed................: 2.54%  âœ“ 4      âœ— 153
     http_req_receiving.............: avg=25.4ms   min=74.73Âµs med=1.96ms   max=500.57ms  p(90)=14.99ms   p(95)=248.82ms 
     http_req_sending...............: avg=68.84Âµs min=19.57Âµs med=70.04Âµs max=236.97Âµs p(90)=107.71Âµs p(95)=119.64Âµs
     http_req_tls_handshaking.......: avg=32.83ms  min=0s       med=0s       max=523.06ms  p(90)=0s        p(95)=510.72ms 
     http_req_waiting...............: avg=597.62ms min=256ms    med=291.26ms max=3.19s     p(90)=1.77s     p(95)=2.27s    
     http_reqs......................: 157    5.940933/s
     iteration_duration.............: avg=1.72s    min=1.26s    med=1.31s    max=4.66s     p(90)=2.9s      p(95)=3.46s    
     iterations.....................: 150    5.67605/s
     vus............................: 10     min=10     max=10 
     vus_max........................: 10     min=10     max=10